xdu-aero-association/FM33LC0XX_Example_0.04/I2C 查询读写FM38025T/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_adc.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_adc.h
  * @author  FMSH Application Team
  * @brief   Head file of ADC LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_ADC_H
#define __FM33LC0XX_LL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_ADC
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_ES_INIT ADC Exported Init structures
  * @{
  */

/**
  * @brief LL ADC Init Sturcture definition
  */
typedef  struct
{
    uint32_t AdcClockSource;
    
    uint32_t AdcClockPrescaler;

}LL_ADC_CommonInitTypeDef;	
	
typedef struct
{ 
    
  uint32_t ADC_ContinuousConvMode;    
    
  uint32_t ADC_AutoMode;

  uint32_t ADC_WaitMode;

  uint32_t ADC_OverrunMode;
                                                                                
  uint32_t ADC_ScanDirection;
                                                                                
  uint32_t ADC_ExternalTrigConv;

  uint32_t ADC_SamplingTimeControl;

  uint32_t ADC_SamplingStartControl;
                                  
  uint32_t ADC_Channel_Swap_Wiat;                 
                                          
  uint32_t ADC_Channel_Fast_Time; 

  uint32_t ADC_Channel_Slow_Time;

  FunState ADC_Oversampling;

  uint32_t ADC_OverSampingRatio;

  uint32_t ADC_OversamplingShift;                                        
                                          
}LL_ADC_InitTypeDef;	
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Constants ADC Exported Constants
  * @{
  */
#define    LL_ADC_EXTERNAL_CH_0                                   (0x1U << 0U)
#define    LL_ADC_EXTERNAL_CH_1                                   (0x1U << 1U)
#define    LL_ADC_EXTERNAL_CH_2                                   (0x1U << 2U)
#define    LL_ADC_EXTERNAL_CH_3                                   (0x1U << 3U)
#define    LL_ADC_EXTERNAL_CH_4                                   (0x1U << 4U)
#define    LL_ADC_EXTERNAL_CH_5                                   (0x1U << 5U)
#define    LL_ADC_EXTERNAL_CH_6                                   (0x1U << 6U)
#define    LL_ADC_EXTERNAL_CH_7                                   (0x1U << 7U)
#define    LL_ADC_EXTERNAL_CH_8                                   (0x1U << 8U)
#define    LL_ADC_EXTERNAL_CH_9                                   (0x1U << 9U)
#define    LL_ADC_EXTERNAL_CH_10                                  (0x1U << 10U)
#define    LL_ADC_EXTERNAL_CH_11                                  (0x1U << 11U)
#define    LL_ADC_EXTERNAL_CH_ALL                                 (0xfffU << 0U)
#define    LL_ADC_INTERNAL_CH_TEMPSENSOR                          (0x1U << 16U)
#define    LL_ADC_INTERNAL_CH_VREF                                (0x1U << 17U)
#define    LL_ADC_INTERNAL_CH_ALL                                 (0x3U << 16U)
#define    LL_ADC_OUTPUT_CH_OPA1                                  (0x1U << 18U)
#define    LL_ADC_OUTPUT_CH_OPA2                                  (0x1U << 19U)
#define    LL_ADC_OUTPUT_CH_ALL                                   (0x3U << 18U)

#define    LL_ADC_SAMPLING_TIME_CONTROL_BY_REG                    (0x0U << ADC_CR_EXSAMP_Pos)
#define    LL_ADC_SAMPLING_TIME_CONTROL_BY_IO_INPUT               (0x1U << ADC_CR_EXSAMP_Pos)

#define    LL_ADC_SAMPLING_START_CONTROL_BY_REG                   (0x0U << ADC_CR_EXSYNC_Pos)
#define    LL_ADC_SAMPLING_START_CONTROL_BY_IO_INPUT              (0x1U << ADC_CR_EXSYNC_Pos)

#define    LL_ADC_TRIG_EXT_PA8                                    (0x0U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_PB9                                    (0x1U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_ATIM_TRGO                              (0x3U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_GPTIM1_TRGO                            (0x4U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_GPTIM2_TRGO                            (0x5U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_RTC_TRGO                               (0x7U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_BSTIM1_TRGO                            (0x8U << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_COMP1_TRGO                             (0xaU << ADC_CFGR_EXTS_Pos)
#define    LL_ADC_TRIG_EXT_COMP2_TRGO                             (0xbU << ADC_CFGR_EXTS_Pos)

#define    LL_ADC_CONV_SINGLE                                     (0x0U << ADC_CFGR_CONT_Pos)
#define    LL_ADC_CONV_CONTINUOUS                                 (0x1U << ADC_CFGR_CONT_Pos)

#define    LL_ADC_AWD_CHANNEL_0_REG                               (0x0U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_1_REG                               (0x1U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_2_REG                               (0x2U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_3_REG                               (0x3U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_4_REG                               (0x4U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_5_REG                               (0x5U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_6_REG                               (0x6U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_7_REG                               (0x7U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_8_REG                               (0x8U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_9_REG                               (0x9U << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_10_REG                              (0xaU << ADC_CFGR_AWDCH_Pos)
#define    LL_ADC_AWD_CHANNEL_11_REG                              (0xbU << ADC_CFGR_AWDCH_Pos)

#define    LL_ADC_AWD_ALL_CHANNELS_REG                            (0x0U << ADC_CFGR_AWDSC_Pos)
#define    LL_ADC_AWD_SINGLE_CHANNEL_REG                          (0x1U << ADC_CFGR_AWDSC_Pos)

#define    LL_ADC_OVR_DATA_PRESERVED                              (0x0U << ADC_CFGR_OVRM_Pos)
#define    LL_ADC_OVR_DATA_OVERWRITTEN                            (0x1U << ADC_CFGR_OVRM_Pos)

#define    LL_ADC_EXT_TRIGGER_NONE                                (0x0U << ADC_CFGR_TRGCFG_Pos)
#define    LL_ADC_EXT_TRIGGER_RISING                              (0x1U << ADC_CFGR_TRGCFG_Pos)
#define    LL_ADC_EXT_TRIGGER_FALLING                             (0x2U << ADC_CFGR_TRGCFG_Pos)
#define    LL_ADC_EXT_TRIGGER_BOTHEDGE                            (0x3U << ADC_CFGR_TRGCFG_Pos)

#define    LL_ADC_SEQ_SCAN_DIR_FORWARD                            (0x0U << ADC_CFGR_SCANDIR_Pos)
#define    LL_ADC_SEQ_SCAN_DIR_BACKWARD                           (0x1U << ADC_CFGR_SCANDIR_Pos)

#define    LL_ADC_WAIT_MODE_NO_WAIT                               (0x0U << ADC_CFGR_WAIT_Pos)
#define    LL_ADC_WAIT_MODE_WAIT                                  (0x1U << ADC_CFGR_WAIT_Pos)

#define    LL_ADC_SINGLE_CONV_MODE_AUTO                           (0x0U << ADC_CFGR_SEMI_Pos)
#define    LL_ADC_SINGLE_CONV_MODE_SEMIAUTO                       (0x1U << ADC_CFGR_SEMI_Pos)

#define    LL_ADC_OVERSAMPLING_2X                                 (0x0U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_4X                                 (0x1U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_8X                                 (0x2U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_16X                                (0x3U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_32X                                (0x4U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_64X                                (0x5U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_128X                               (0x6U << ADC_CFGR_OVSR_Pos)
#define    LL_ADC_OVERSAMPLING_256X                               (0x7U << ADC_CFGR_OVSR_Pos)

#define    LL_ADC_OVERSAMPLING_RESULT_ORIGINAL                    (0x0U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV2                        (0x1U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV4                        (0x2U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV8                        (0x3U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV16                       (0x4U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV32                       (0x5U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV64                       (0x6U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV128                      (0x7U << ADC_CFGR_OVSS_Pos)
#define    LL_ADC_OVERSAMPLING_RESULT_DIV256                      (0x8U << ADC_CFGR_OVSS_Pos)

#define    LL_ADC_DMA_TRANSFER_MODE_SINGLE                        (0x0U << ADC_CFGR_DMACFG_Pos)
#define    LL_ADC_DMA_TRANSFER_MODE_CIRCLE                        (0x1U << ADC_CFGR_DMACFG_Pos)

#define    LL_ADC_SLOW_CH_SAMPLING_TIME_4_ADCCLK                  (0x0U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_6_ADCCLK                  (0x1U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_9_ADCCLK                  (0x2U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_10_ADCCLK                 (0x3U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_16_ADCCLK                 (0x4U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_24_ADCCLK                 (0x5U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_32_ADCCLK                 (0x6U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_48_ADCCLK                 (0x7U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_96_ADCCLK                 (0x8U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_128_ADCCLK                (0x9U << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_192_ADCCLK                (0xaU << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_256_ADCCLK                (0xbU << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_384_ADCCLK                (0xcU << ADC_SMTR_SMTS1_Pos)
#define    LL_ADC_SLOW_CH_SAMPLING_TIME_SOFTWARE_CONTROL          (0xdU << ADC_SMTR_SMTS1_Pos)

#define    LL_ADC_FAST_CH_SAMPLING_TIME_4_ADCCLK                  (0x0U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_6_ADCCLK                  (0x1U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_9_ADCCLK                  (0x2U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_10_ADCCLK                 (0x3U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_16_ADCCLK                 (0x4U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_24_ADCCLK                 (0x5U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_32_ADCCLK                 (0x6U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_48_ADCCLK                 (0x7U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_96_ADCCLK                 (0x8U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_128_ADCCLK                (0x9U << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_192_ADCCLK                (0xaU << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_256_ADCCLK                (0xbU << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_384_ADCCLK                (0xcU << ADC_SMTR_SMTS2_Pos)
#define    LL_ADC_FAST_CH_SAMPLING_TIME_SOFTWARE_CONTROL          (0xdU << ADC_SMTR_SMTS2_Pos)

