xdu-aero-association/FM33LC0XX_Example_0.04/I2C 查询读写FM38025T/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_adc.h
#define    LL_ADC_SAMPLEING_INTERVAL_2_CYCLE                      (0x0U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_3_CYCLES                     (0x3U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_4_CYCLES                     (0x4U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_5_CYCLES                     (0x5U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_6_CYCLES                     (0x6U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_7_CYCLES                     (0x7U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_8_CYCLES                     (0x8U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_9_CYCLES                     (0x9U << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_10_CYCLES                    (0xaU << ADC_SMTR_CHCG_Pos)
#define    LL_ADC_SAMPLEING_INTERVAL_11_CYCLES                    (0xbU << ADC_SMTR_CHCG_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Functions ADC Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   CR    ADEN    LL_ADC_Enable
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_Enable(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CR, ADC_CR_ADEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    ADEN    LL_ADC_Disable
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_Disable(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CR, ADC_CR_ADEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    ADEN    LL_ADC_IsEnabled
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabled(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CR, ADC_CR_ADEN_Msk) == ADC_CR_ADEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    START    LL_ADC_StartConversion
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_StartConversion(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CR, ADC_CR_START_Msk);
}

/**
  * @brief    
  * @rmtoll   SAMPT    SAMPT_S    LL_ADC_SoftwareStopSampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SoftwareStopSampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->SAMPT, ADC_SAMPT_SAMPT_S_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EXSAMP    LL_ADC_SetSamplingTimeControlMode
  * @param    ADCx ADC instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLING_TIME_CONTROL_BY_REG
  *           @arg @ref LL_ADC_SAMPLING_TIME_CONTROL_BY_IO_INPUT
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSamplingTimeControlMode(ADC_Type *ADCx, uint32_t Mode)
{
    MODIFY_REG(ADCx->CR, ADC_CR_EXSAMP_Msk, Mode);
}

/**
  * @brief    
  * @rmtoll   CR    EXSAMP    LL_ADC_GetSamplingTimeControlMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLING_TIME_CONTROL_BY_REG
  *           @arg @ref LL_ADC_SAMPLING_TIME_CONTROL_BY_IO_INPUT
  */
__STATIC_INLINE uint32_t LL_ADC_GetSamplingTimeControlMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CR, ADC_CR_EXSAMP_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    EXSYNC    LL_ADC_Set_SamplingStartControlMode
  * @param    ADCx ADC instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLING_START_CONTROL_BY_REG
  *           @arg @ref LL_ADC_SAMPLING_START_CONTROL_BY_IO_INPUT
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_Set_SamplingStartControlMode(ADC_Type *ADCx, uint32_t Mode)
{
    MODIFY_REG(ADCx->CR, ADC_CR_EXSYNC_Msk, Mode);
}

/**
  * @brief    
  * @rmtoll   CR    EXSYNC    LL_ADC_Get_SamplingStartControlMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLING_START_CONTROL_BY_REG
  *           @arg @ref LL_ADC_SAMPLING_START_CONTROL_BY_IO_INPUT
  */
__STATIC_INLINE uint32_t LL_ADC_Get_SamplingStartControlMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CR, ADC_CR_EXSYNC_Msk));
}

/**
  * @brief    
  * @rmtoll   DR    DATA    LL_ADC_DMA_GetRegAddr
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ADC_DMA_GetRegAddr(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CFGR    EXTS    LL_ADC_SetTriggerSource
  * @param    ADCx ADC instance
  * @param    TriggerSource This parameter can be one of the following values:
  *           @arg @ref LL_ADC_TRIG_EXT_PA8
  *           @arg @ref LL_ADC_TRIG_EXT_PB9
  *           @arg @ref LL_ADC_TRIG_EXT_ATIM_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_GPTIM1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_GPTIM2_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_RTC_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_BSTIM1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_COMP1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_COMP2_TRGO
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetTriggerSource(ADC_Type *ADCx, uint32_t TriggerSource)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_EXTS_Msk, TriggerSource);
}

/**
  * @brief    
  * @rmtoll   CFGR    EXTS    LL_ADC_GetTriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_TRIG_EXT_PA8
  *           @arg @ref LL_ADC_TRIG_EXT_PB9
  *           @arg @ref LL_ADC_TRIG_EXT_ATIM_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_GPTIM1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_GPTIM2_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_RTC_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_BSTIM1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_COMP1_TRGO
  *           @arg @ref LL_ADC_TRIG_EXT_COMP2_TRGO
  */
__STATIC_INLINE uint32_t LL_ADC_GetTriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_EXTS_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    CONT    LL_ADC_SetContinuousMode
  * @param    ADCx ADC instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_CONV_SINGLE
  *           @arg @ref LL_ADC_CONV_CONTINUOUS
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetContinuousMode(ADC_Type *ADCx, uint32_t Mode)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_CONT_Msk, Mode);
}

/**
  * @brief    
  * @rmtoll   CFGR    CONT    LL_ADC_GetContinuousMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_CONV_SINGLE
  *           @arg @ref LL_ADC_CONV_CONTINUOUS
  */
__STATIC_INLINE uint32_t LL_ADC_GetContinuousMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_CONT_Msk));
}

/**
  * @brief    
  * @rmtoll   IER    EOCIE    LL_ADC_EnableIT_EOC
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOC(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_EOCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    EOSIE    LL_ADC_EnableIT_EOS
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOS(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_EOSIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    OVRIE    LL_ADC_EnableIT_OVR
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableIT_OVR(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_OVRIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_ULIE    LL_ADC_EnableIT_AWD_UL
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD_UL(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_AWD_ULIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_AHIE    LL_ADC_EnableIT_AWD_AH
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD_AH(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_AWD_AHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    EOCIE    LL_ADC_DisableIT_EOC
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOC(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_EOCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    EOSIE    LL_ADC_DisableIT_EOS
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOS(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_EOSIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    OVRIE    LL_ADC_DisableIT_OVR
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableIT_OVR(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_OVRIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_ULIE    LL_ADC_DisableIT_AWD_UL
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD_UL(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_AWD_ULIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_AHIE    LL_ADC_DisableIT_AWD_AH
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD_AH(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_AWD_AHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    EOCIE    LL_ADC_IsEnabledIT_EOC
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOC(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_EOCIE_Msk) == ADC_IER_EOCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    EOSIE    LL_ADC_IsEnabledIT_EOS
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOS(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_EOSIE_Msk) == ADC_IER_EOSIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    OVRIE    LL_ADC_IsEnabledIT_OVR
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_OVR(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_OVRIE_Msk) == ADC_IER_OVRIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_ULIE    LL_ADC_IsEnabledIT_AWD_UL
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD_UL(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_AWD_ULIE_Msk) == ADC_IER_AWD_ULIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    AWD_AHIE    LL_ADC_IsEnabledIT_AWD_AH
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD_AH(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_AWD_AHIE_Msk) == ADC_IER_AWD_AHIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    EOC    LL_ADC_IsActiveFlag_EOC
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOC(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_EOC_Msk) == (ADC_ISR_EOC_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    EOS    LL_ADC_IsActiveFlag_EOS
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOS(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_EOS_Msk) == (ADC_ISR_EOS_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    OVR    LL_ADC_IsActiveFlag_OVR
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_OVR(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_OVR_Msk) == (ADC_ISR_OVR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    BUSY    LL_ADC_IsActiveFlag_BUSY
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_BUSY(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_BUSY_Msk) == (ADC_ISR_BUSY_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    AWD_UL    LL_ADC_IsActiveFlag_AWD_UL
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD_UL(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_AWD_UL_Msk) == (ADC_ISR_AWD_UL_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    AWD_AH    LL_ADC_IsActiveFlag_AWD_AH
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD_AH(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_AWD_AH_Msk) == (ADC_ISR_AWD_AH_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    EOC    LL_ADC_ClearFlag_EOC
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOC(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_EOC_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    EOS    LL_ADC_ClearFlag_EOS
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOS(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_EOS_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    OVR    LL_ADC_ClearFlag_OVR
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_OVR(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_OVR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    AWD_UL    LL_ADC_ClearFlag_AWD_UL
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD_UL(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_AWD_UL_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    AWD_AH    LL_ADC_ClearFlag_AWD_AH
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD_AH(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_AWD_AH_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDCH    LL_ADC_SetAnalogWDMonitChannelSelect
  * @param    ADCx ADC instance
  * @param    AWDChannelGroup This parameter can be one of the following values:
  *           @arg @ref LL_ADC_AWD_CHANNEL_0_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_1_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_2_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_3_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_4_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_5_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_6_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_7_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_8_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_9_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_10_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_11_REG
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDMonitChannelSelect(ADC_Type *ADCx, uint32_t AWDChannelGroup)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_AWDCH_Msk, AWDChannelGroup);
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDCH    LL_ADC_GetAnalogWDMonitChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_AWD_CHANNEL_0_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_1_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_2_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_3_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_4_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_5_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_6_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_7_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_8_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_9_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_10_REG
  *           @arg @ref LL_ADC_AWD_CHANNEL_11_REG
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDMonitChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_AWDCH_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDSC    LL_ADC_SetAnalogWDMonitChannelMode
  * @param    ADCx ADC instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG
  *           @arg @ref LL_ADC_AWD_SINGLE_CHANNEL_REG
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWDMonitChannelMode(ADC_Type *ADCx, uint32_t Mode)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_AWDSC_Msk, Mode);
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDSC    LL_ADC_GetAnalogWDMonitChannelMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_AWD_ALL_CHANNELS_REG
  *           @arg @ref LL_ADC_AWD_SINGLE_CHANNEL_REG
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWDMonitChannelMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_AWDSC_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDEN    LL_ADC_EnableAnologWD
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableAnologWD(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR, ADC_CFGR_AWDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDEN    LL_ADC_DisableAnologWD
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableAnologWD(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR, ADC_CFGR_AWDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    AWDEN    LL_ADC_IsEnabledAnologWD
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledAnologWD(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_AWDEN_Msk) == ADC_CFGR_AWDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVRM    LL_ADC_SetOverrun
  * @param    ADCx ADC instance
  * @param    Overrun This parameter can be one of the following values:
  *           @arg @ref LL_ADC_OVR_DATA_PRESERVED
  *           @arg @ref LL_ADC_OVR_DATA_OVERWRITTEN
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetOverrun(ADC_Type *ADCx, uint32_t Overrun)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_OVRM_Msk, Overrun);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVRM    LL_ADC_GetOverrun
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_OVR_DATA_PRESERVED
  *           @arg @ref LL_ADC_OVR_DATA_OVERWRITTEN
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverrun(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_OVRM_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    IOTRFEN    LL_ADC_EnableTriggerFilter
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableTriggerFilter(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR, ADC_CFGR_IOTRFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    IOTRFEN    LL_ADC_DisableTriggerFilter
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableTriggerFilter(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR, ADC_CFGR_IOTRFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    IOTRFEN    LL_ADC_IsEnabledTriggerFilter
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledTriggerFilter(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_IOTRFEN_Msk) == ADC_CFGR_IOTRFEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    TRGCFG    LL_ADC_SetTriggerEdge
  * @param    ADCx ADC instance
  * @param    ExternalTriggerEdge This parameter can be one of the following values:
  *           @arg @ref LL_ADC_EXT_TRIGGER_NONE
  *           @arg @ref LL_ADC_EXT_TRIGGER_RISING
  *           @arg @ref LL_ADC_EXT_TRIGGER_FALLING
  *           @arg @ref LL_ADC_EXT_TRIGGER_BOTHEDGE
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetTriggerEdge(ADC_Type *ADCx, uint32_t ExternalTriggerEdge)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_TRGCFG_Msk, ExternalTriggerEdge);
}

/**
  * @brief    
  * @rmtoll   CFGR    TRGCFG    LL_ADC_GetTriggerEdge
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_EXT_TRIGGER_NONE
  *           @arg @ref LL_ADC_EXT_TRIGGER_RISING
  *           @arg @ref LL_ADC_EXT_TRIGGER_FALLING
  *           @arg @ref LL_ADC_EXT_TRIGGER_BOTHEDGE
  */
__STATIC_INLINE uint32_t LL_ADC_GetTriggerEdge(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_TRGCFG_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    SCANDIR    LL_ADC_SetSequencerScanDirection
  * @param    ADCx ADC instance
  * @param    ScanDirection This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SEQ_SCAN_DIR_FORWARD
  *           @arg @ref LL_ADC_SEQ_SCAN_DIR_BACKWARD
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSequencerScanDirection(ADC_Type *ADCx, uint32_t ScanDirection)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_SCANDIR_Msk, ScanDirection);
}

/**
  * @brief    
  * @rmtoll   CFGR    SCANDIR    LL_ADC_GetSequencerScanDirection
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SEQ_SCAN_DIR_FORWARD
  *           @arg @ref LL_ADC_SEQ_SCAN_DIR_BACKWARD
  */
__STATIC_INLINE uint32_t LL_ADC_GetSequencerScanDirection(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_SCANDIR_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    WAIT    LL_ADC_SetWaitMode
  * @param    ADCx ADC instance
  * @param    WaitMode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_WAIT_MODE_NO_WAIT
  *           @arg @ref LL_ADC_WAIT_MODE_WAIT
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetWaitMode(ADC_Type *ADCx, uint32_t WaitMode)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_WAIT_Msk, WaitMode);
}

/**
  * @brief    
  * @rmtoll   CFGR    WAIT    LL_ADC_GetWaitMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_WAIT_MODE_NO_WAIT
  *           @arg @ref LL_ADC_WAIT_MODE_WAIT
  */
__STATIC_INLINE uint32_t LL_ADC_GetWaitMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_WAIT_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    SEMI    LL_ADC_SetSingleConversionAutoMode
  * @param    ADCx ADC instance
  * @param    AutoMode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SINGLE_CONV_MODE_AUTO
  *           @arg @ref LL_ADC_SINGLE_CONV_MODE_SEMIAUTO
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSingleConversionAutoMode(ADC_Type *ADCx, uint32_t AutoMode)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_SEMI_Msk, AutoMode);
}

/**
  * @brief    
  * @rmtoll   CFGR    SEMI    LL_ADC_GetSingleConversionAutoMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SINGLE_CONV_MODE_AUTO
  *           @arg @ref LL_ADC_SINGLE_CONV_MODE_SEMIAUTO
  */
__STATIC_INLINE uint32_t LL_ADC_GetSingleConversionAutoMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_SEMI_Msk));
}

/**
  * @brief    
  * @rmtoll   HLTR    AWD_LT    LL_ADC_SetAnalogWD_LowThreshold
  * @param    ADCx ADC instance
  * @param    ThresholdValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWD_LowThreshold(ADC_Type *ADCx, uint32_t ThresholdValue)
{
    MODIFY_REG(ADCx->HLTR, (0xfffU << 0U), (ThresholdValue << 0U));
}

/**
  * @brief    
  * @rmtoll   HLTR    AWD_LT    LL_ADC_GetAnalogWD_LowThreshold
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWD_LowThreshold(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->HLTR, 0xfffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   HLTR    AWD_HT    LL_ADC_SetAnalogWD_HighThreshold
  * @param    ADCx ADC instance
  * @param    ThresholdValue 
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetAnalogWD_HighThreshold(ADC_Type *ADCx, uint32_t ThresholdValue)
{
    MODIFY_REG(ADCx->HLTR, (0xfffU << 16U), (ThresholdValue << 16U));
}

/**
  * @brief    
  * @rmtoll   HLTR    AWD_HT    LL_ADC_GetAnalogWD_HighThreshold
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ADC_GetAnalogWD_HighThreshold(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->HLTR, 0xfffU) >> 16U);
}

