xdu-aero-association/FM33LC0XX_Example_0.04/I2C 查询读写FM38025T/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_adc.h
/**
  * @brief    
  * @rmtoll   CFGR    OVSEN    LL_ADC_EnableOverSampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableOverSampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR, ADC_CFGR_OVSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSEN    LL_ADC_DisableOverSampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableOverSampling(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR, ADC_CFGR_OVSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSEN    LL_ADC_IsEnabledOverSampling
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledOverSampling(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_OVSEN_Msk) == ADC_CFGR_OVSEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSR    LL_ADC_SetOverSamplingRatio
  * @param    ADCx ADC instance
  * @param    OverSamplingRatio This parameter can be one of the following values:
  *           @arg @ref LL_ADC_OVERSAMPLING_2X
  *           @arg @ref LL_ADC_OVERSAMPLING_4X
  *           @arg @ref LL_ADC_OVERSAMPLING_8X
  *           @arg @ref LL_ADC_OVERSAMPLING_16X
  *           @arg @ref LL_ADC_OVERSAMPLING_32X
  *           @arg @ref LL_ADC_OVERSAMPLING_64X
  *           @arg @ref LL_ADC_OVERSAMPLING_128X
  *           @arg @ref LL_ADC_OVERSAMPLING_256X
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetOverSamplingRatio(ADC_Type *ADCx, uint32_t OverSamplingRatio)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_OVSR_Msk, OverSamplingRatio);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSR    LL_ADC_GetOverSamplingRatio
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_OVERSAMPLING_2X
  *           @arg @ref LL_ADC_OVERSAMPLING_4X
  *           @arg @ref LL_ADC_OVERSAMPLING_8X
  *           @arg @ref LL_ADC_OVERSAMPLING_16X
  *           @arg @ref LL_ADC_OVERSAMPLING_32X
  *           @arg @ref LL_ADC_OVERSAMPLING_64X
  *           @arg @ref LL_ADC_OVERSAMPLING_128X
  *           @arg @ref LL_ADC_OVERSAMPLING_256X
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingRatio(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_OVSR_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSS    LL_ADC_SetOverSamplingResult
  * @param    ADCx ADC instance
  * @param    OverSamplingShift This parameter can be one of the following values:
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_ORIGINAL
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV2
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV4
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV8
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV16
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV32
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV64
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV128
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV256
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetOverSamplingResult(ADC_Type *ADCx, uint32_t OverSamplingShift)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_OVSS_Msk, OverSamplingShift);
}

/**
  * @brief    
  * @rmtoll   CFGR    OVSS    LL_ADC_GetOverSamplingResult
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_ORIGINAL
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV2
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV4
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV8
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV16
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV32
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV64
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV128
  *           @arg @ref LL_ADC_OVERSAMPLING_RESULT_DIV256
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverSamplingResult(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_OVSS_Msk));
}

/**
  * @brief    
  * @rmtoll   CFGR    DMAEN    LL_ADC_EnableDMATransfer
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnableDMATransfer(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR, ADC_CFGR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    DMAEN    LL_ADC_DisableDMATransfer
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableDMATransfer(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR, ADC_CFGR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    DMAEN    LL_ADC_IsEnabledDMATransfer
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledDMATransfer(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_DMAEN_Msk) == ADC_CFGR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFGR    DMACFG    LL_ADC_SetDMAMode
  * @param    ADCx ADC instance
  * @param    DMAMode This parameter can be one of the following values:
  *           @arg @ref LL_ADC_DMA_TRANSFER_MODE_SINGLE
  *           @arg @ref LL_ADC_DMA_TRANSFER_MODE_CIRCLE
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetDMAMode(ADC_Type *ADCx, uint32_t DMAMode)
{
    MODIFY_REG(ADCx->CFGR, ADC_CFGR_DMACFG_Msk, DMAMode);
}

/**
  * @brief    
  * @rmtoll   CFGR    DMACFG    LL_ADC_GetDMAMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_DMA_TRANSFER_MODE_SINGLE
  *           @arg @ref LL_ADC_DMA_TRANSFER_MODE_CIRCLE
  */
__STATIC_INLINE uint32_t LL_ADC_GetDMAMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR, ADC_CFGR_DMACFG_Msk));
}

/**
  * @brief    
  * @rmtoll   SMTR    SMTS1    LL_ADC_SetSamplingTimeSlowCH
  * @param    ADCx ADC instance
  * @param    SamplingTime This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_6_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_9_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_10_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_24_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_48_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_384_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_SOFTWARE_CONTROL
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSamplingTimeSlowCH(ADC_Type *ADCx, uint32_t SamplingTime)
{
    MODIFY_REG(ADCx->SMTR, ADC_SMTR_SMTS1_Msk, SamplingTime);
}

/**
  * @brief    
  * @rmtoll   SMTR    SMTS1    LL_ADC_GetlSamplingTimeSlowCH
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_6_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_9_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_10_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_24_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_48_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_384_ADCCLK
  *           @arg @ref LL_ADC_SLOW_CH_SAMPLING_TIME_SOFTWARE_CONTROL
  */
__STATIC_INLINE uint32_t LL_ADC_GetlSamplingTimeSlowCH(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SMTR, ADC_SMTR_SMTS1_Msk));
}

/**
  * @brief    
  * @rmtoll   SMTR    SMTS2    LL_ADC_SetSamplingTimeFastCH
  * @param    ADCx ADC instance
  * @param    SamplingTime This parameter can be one of the following values:
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_6_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_9_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_10_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_24_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_48_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_384_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_SOFTWARE_CONTROL
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSamplingTimeFastCH(ADC_Type *ADCx, uint32_t SamplingTime)
{
    MODIFY_REG(ADCx->SMTR, ADC_SMTR_SMTS2_Msk, SamplingTime);
}

/**
  * @brief    
  * @rmtoll   SMTR    SMTS2    LL_ADC_GetSamplingTimeFastCH
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_6_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_9_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_10_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_24_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_48_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_384_ADCCLK
  *           @arg @ref LL_ADC_FAST_CH_SAMPLING_TIME_SOFTWARE_CONTROL
  */
__STATIC_INLINE uint32_t LL_ADC_GetSamplingTimeFastCH(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SMTR, ADC_SMTR_SMTS2_Msk));
}

/**
  * @brief    
  * @rmtoll   SMTR    CHCG    LL_ADC_SetSamplingInterval
  * @param    ADCx ADC instance
  * @param    SamplingInterval This parameter can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_2_CYCLE
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_3_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_4_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_5_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_6_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_7_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_8_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_9_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_10_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_11_CYCLES
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_SetSamplingInterval(ADC_Type *ADCx, uint32_t SamplingInterval)
{
    MODIFY_REG(ADCx->SMTR, ADC_SMTR_CHCG_Msk, SamplingInterval);
}

/**
  * @brief    
  * @rmtoll   SMTR    CHCG    LL_ADC_GetSamplingInterval
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_2_CYCLE
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_3_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_4_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_5_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_6_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_7_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_8_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_9_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_10_CYCLES
  *           @arg @ref LL_ADC_SAMPLEING_INTERVAL_11_CYCLES
  */
__STATIC_INLINE uint32_t LL_ADC_GetSamplingInterval(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SMTR, ADC_SMTR_CHCG_Msk));
}

/**
  * @brief    
  * @rmtoll   CHER        LL_ADC_EnalbleSequencerChannel
  * @param    ADCx ADC instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ADC_EXTERNAL_CH_0
  *           @arg @ref LL_ADC_EXTERNAL_CH_1
  *           @arg @ref LL_ADC_EXTERNAL_CH_2
  *           @arg @ref LL_ADC_EXTERNAL_CH_3
  *           @arg @ref LL_ADC_EXTERNAL_CH_4
  *           @arg @ref LL_ADC_EXTERNAL_CH_5
  *           @arg @ref LL_ADC_EXTERNAL_CH_6
  *           @arg @ref LL_ADC_EXTERNAL_CH_7
  *           @arg @ref LL_ADC_EXTERNAL_CH_8
  *           @arg @ref LL_ADC_EXTERNAL_CH_9
  *           @arg @ref LL_ADC_EXTERNAL_CH_10
  *           @arg @ref LL_ADC_EXTERNAL_CH_11
  *           @arg @ref LL_ADC_EXTERNAL_CH_ALL
  *           @arg @ref LL_ADC_INTERNAL_CH_TEMPSENSOR
  *           @arg @ref LL_ADC_INTERNAL_CH_VREF
  *           @arg @ref LL_ADC_INTERNAL_CH_ALL
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA1
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA2
  *           @arg @ref LL_ADC_OUTPUT_CH_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_EnalbleSequencerChannel(ADC_Type *ADCx, uint32_t Channel)
{
    SET_BIT(ADCx->CHER, ((Channel & 0xfffff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   CHER        LL_ADC_DisableSequencerChannel
  * @param    ADCx ADC instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ADC_EXTERNAL_CH_0
  *           @arg @ref LL_ADC_EXTERNAL_CH_1
  *           @arg @ref LL_ADC_EXTERNAL_CH_2
  *           @arg @ref LL_ADC_EXTERNAL_CH_3
  *           @arg @ref LL_ADC_EXTERNAL_CH_4
  *           @arg @ref LL_ADC_EXTERNAL_CH_5
  *           @arg @ref LL_ADC_EXTERNAL_CH_6
  *           @arg @ref LL_ADC_EXTERNAL_CH_7
  *           @arg @ref LL_ADC_EXTERNAL_CH_8
  *           @arg @ref LL_ADC_EXTERNAL_CH_9
  *           @arg @ref LL_ADC_EXTERNAL_CH_10
  *           @arg @ref LL_ADC_EXTERNAL_CH_11
  *           @arg @ref LL_ADC_EXTERNAL_CH_ALL
  *           @arg @ref LL_ADC_INTERNAL_CH_TEMPSENSOR
  *           @arg @ref LL_ADC_INTERNAL_CH_VREF
  *           @arg @ref LL_ADC_INTERNAL_CH_ALL
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA1
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA2
  *           @arg @ref LL_ADC_OUTPUT_CH_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_ADC_DisableSequencerChannel(ADC_Type *ADCx, uint32_t Channel)
{
    CLEAR_BIT(ADCx->CHER, ((Channel & 0xfffff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   CHER        LL_ADC_IsEnabledSequencerChannel
  * @param    ADCx ADC instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_ADC_EXTERNAL_CH_0
  *           @arg @ref LL_ADC_EXTERNAL_CH_1
  *           @arg @ref LL_ADC_EXTERNAL_CH_2
  *           @arg @ref LL_ADC_EXTERNAL_CH_3
  *           @arg @ref LL_ADC_EXTERNAL_CH_4
  *           @arg @ref LL_ADC_EXTERNAL_CH_5
  *           @arg @ref LL_ADC_EXTERNAL_CH_6
  *           @arg @ref LL_ADC_EXTERNAL_CH_7
  *           @arg @ref LL_ADC_EXTERNAL_CH_8
  *           @arg @ref LL_ADC_EXTERNAL_CH_9
  *           @arg @ref LL_ADC_EXTERNAL_CH_10
  *           @arg @ref LL_ADC_EXTERNAL_CH_11
  *           @arg @ref LL_ADC_EXTERNAL_CH_ALL
  *           @arg @ref LL_ADC_INTERNAL_CH_TEMPSENSOR
  *           @arg @ref LL_ADC_INTERNAL_CH_VREF
  *           @arg @ref LL_ADC_INTERNAL_CH_ALL
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA1
  *           @arg @ref LL_ADC_OUTPUT_CH_OPA2
  *           @arg @ref LL_ADC_OUTPUT_CH_ALL
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledSequencerChannel(ADC_Type *ADCx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(ADCx->CHER, ((Channel & 0xfffff) << 0x0U)) == ((Channel & 0xfffff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DR        LL_ADC_ReadConversionData16
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ADC_ReadConversionData16(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DR        LL_ADC_ReadConversionData12
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_ADC_ReadConversionData12(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DR, 0xffffU) >> 0U);
}

/**
  * @}
  */

/** @defgroup ADC_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_ADC_CommonDeInit(void);
ErrorStatus  LL_ADC_DeInit(ADC_Type *ADCx);
uint32_t GetActualVddaVoltage(ADC_Type *ADCx);
void LL_ADC_StructInit(LL_ADC_InitTypeDef *ADC_InitStruct);
ErrorStatus LL_ADC_Init(ADC_Type *ADCx,LL_ADC_InitTypeDef  *ADC_InitStruct);
void LL_ADC_CommonStructInit(LL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
ErrorStatus LL_ADC_CommonInit(LL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_ADC_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2020-03-26**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
